In [0]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
%matplotlib inline

In [191]:
df = pd.read_csv('loan_train.csv')
df.head()

   Unnamed: 0  Unnamed: 0.1 loan_status  ...  age             education  Gender
0           0             0     PAIDOFF  ...   45  High School or Below    male
1           2             2     PAIDOFF  ...   33              Bechalor  female
2           3             3     PAIDOFF  ...   27               college    male
3           4             4     PAIDOFF  ...   28               college  female
4           6             6     PAIDOFF  ...   29               college    male

[5 rows x 10 columns]

In [192]:
df.shape

(346, 10)

In [193]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 346 entries, 0 to 345
Data columns (total 10 columns):
Unnamed: 0        346 non-null int64
Unnamed: 0.1      346 non-null int64
loan_status       346 non-null object
Principal         346 non-null int64
terms             346 non-null int64
effective_date    346 non-null object
due_date          346 non-null object
age               346 non-null int64
education         346 non-null object
Gender            346 non-null object
dtypes: int64(5), object(5)
memory usage: 27.2+ KB

In [194]:
df['due_date'] = pd.to_datetime(df['due_date'])
df['effective_date'] = pd.to_datetime(df['effective_date'])
df.head()

   Unnamed: 0  Unnamed: 0.1 loan_status  ...  age             education  Gender
0           0             0     PAIDOFF  ...   45  High School or Below    male
1           2             2     PAIDOFF  ...   33              Bechalor  female
2           3             3     PAIDOFF  ...   27               college    male
3           4             4     PAIDOFF  ...   28               college  female
4           6             6     PAIDOFF  ...   29               college    male

[5 rows x 10 columns]

In [195]:
df['loan_status'].value_counts()

PAIDOFF       260
COLLECTION     86
Name: loan_status, dtype: int64

In [196]:
df['education'].value_counts()

High School or Below    151
college                 149
Bechalor                 44
Master or Above           2
Name: education, dtype: int64

In [197]:
df['Gender'].value_counts()

male      294
female     52
Name: Gender, dtype: int64

In [198]:
df['dayofweek'] = df['effective_date'].dt.dayofweek
df['weekend'] = df['dayofweek'].apply(lambda x: 1 if (x>3)  else 0)
df.head()

   Unnamed: 0  Unnamed: 0.1 loan_status  ...  Gender  dayofweek weekend
0           0             0     PAIDOFF  ...    male          3       0
1           2             2     PAIDOFF  ...  female          3       0
2           3             3     PAIDOFF  ...    male          3       0
3           4             4     PAIDOFF  ...  female          4       1
4           6             6     PAIDOFF  ...    male          4       1

[5 rows x 12 columns]

In [199]:
df.groupby(['Gender'])['loan_status'].value_counts(normalize=True)

Gender  loan_status
female  PAIDOFF        0.865385
        COLLECTION     0.134615
male    PAIDOFF        0.731293
        COLLECTION     0.268707
Name: loan_status, dtype: float64

In [200]:
df['Gender'].replace(to_replace=['male','female'], value=[0,1],inplace=True)
df.head()

   Unnamed: 0  Unnamed: 0.1 loan_status  ...  Gender  dayofweek weekend
0           0             0     PAIDOFF  ...       0          3       0
1           2             2     PAIDOFF  ...       1          3       0
2           3             3     PAIDOFF  ...       0          3       0
3           4             4     PAIDOFF  ...       1          4       1
4           6             6     PAIDOFF  ...       0          4       1

[5 rows x 12 columns]

In [201]:
df.groupby(['education'])['loan_status'].value_counts(normalize=True)

education             loan_status
Bechalor              PAIDOFF        0.750000
                      COLLECTION     0.250000
High School or Below  PAIDOFF        0.741722
                      COLLECTION     0.258278
Master or Above       COLLECTION     0.500000
                      PAIDOFF        0.500000
college               PAIDOFF        0.765101
                      COLLECTION     0.234899
Name: loan_status, dtype: float64

In [202]:
df[['Principal','terms','age','Gender','education']].head()

   Principal  terms  age  Gender             education
0       1000     30   45       0  High School or Below
1       1000     30   33       1              Bechalor
2       1000     15   27       0               college
3       1000     30   28       1               college
4       1000     30   29       0               college

In [203]:
Feature = df[['Principal','terms','age','Gender','weekend']]
Feature = pd.concat([Feature,pd.get_dummies(df['education'])], axis=1)
Feature.drop(['Master or Above'], axis = 1,inplace=True)
Feature.head()

   Principal  terms  age  ...  Bechalor  High School or Below  college
0       1000     30   45  ...         0                     1        0
1       1000     30   33  ...         1                     0        0
2       1000     15   27  ...         0                     0        1
3       1000     30   28  ...         0                     0        1
4       1000     30   29  ...         0                     0        1

[5 rows x 8 columns]

In [204]:
X = Feature
X[0:5]

   Principal  terms  age  ...  Bechalor  High School or Below  college
0       1000     30   45  ...         0                     1        0
1       1000     30   33  ...         1                     0        0
2       1000     15   27  ...         0                     0        1
3       1000     30   28  ...         0                     0        1
4       1000     30   29  ...         0                     0        1

[5 rows x 8 columns]

In [205]:
y = df['loan_status'].values
y[0:5]

array(['PAIDOFF', 'PAIDOFF', 'PAIDOFF', 'PAIDOFF', 'PAIDOFF'],
      dtype=object)

In [0]:
#X= preprocessing.StandardScaler().fit(X).transform(X)
#X[0:5]

In [0]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split( X, y, test_size=0.3, random_state=4)

In [0]:
from sklearn.neighbors import KNeighborsClassifier
k = 9
neigh = KNeighborsClassifier(n_neighbors = k).fit(X_train,y_train)
yhat = neigh.predict(X_test)

In [209]:
from sklearn import metrics
print("KNN Accuracy: ", metrics.accuracy_score(y_test, yhat))

KNN Accuracy:  0.7019230769230769

In [0]:
from sklearn.model_selection import train_test_split
X_trainset, X_testset, y_trainset, y_testset = train_test_split(X, y, test_size=0.3, random_state=4)

In [0]:
from sklearn.tree import DecisionTreeClassifier
loanPaidOff = DecisionTreeClassifier(criterion="entropy", max_depth = 6)
loanPaidOff.fit(X_trainset,y_trainset)
predloanPaidOff = loanPaidOff.predict(X_testset)

In [212]:
from sklearn import metrics
print("Decision Tree Accuracy: ", metrics.accuracy_score(y_testset, predloanPaidOff))

Decision Tree Accuracy:  0.7403846153846154

In [0]:
from sklearn.model_selection import train_test_split
X_trainset, X_testset, y_trainset, y_testset = train_test_split(X, y, test_size=0.3, random_state=4)

In [214]:
from sklearn import svm
clf.fit(X_train, y_train)
yhat = clf.predict(X_test)

/usr/local/lib/python3.6/dist-packages/sklearn/svm/base.py:193: FutureWarning: The default value of gamma will change from 'auto' to 'scale' in version 0.22 to account better for unscaled features. Set gamma explicitly to 'auto' or 'scale' to avoid this warning.
  "avoid this warning.", FutureWarning)

In [215]:
from sklearn import metrics
import matplotlib.pyplot as plt
print("SVC's Accuracy: ", metrics.accuracy_score(y_testset, yhat))

SVC's Accuracy:  0.7307692307692307

In [0]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split( X, y, test_size=0.3, random_state=4)

In [0]:
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import confusion_matrix
LR = LogisticRegression(C=0.098, solver='liblinear').fit(X_train,y_train)
yhat = LR.predict(X_test)

In [218]:
from sklearn import metrics
import matplotlib.pyplot as plt
print("Logistic's Accuracy: ", metrics.accuracy_score(y_test, yhat))

Logistic's Accuracy:  0.7403846153846154

In [219]:
df1=pd.DataFrame({'Algorithm':['KNN','Decision Tree','SVM','Logistic Regression'],'Accuracy':[0.7019,0.7404,0.7308,0.7404]})
df1

             Algorithm  Accuracy
0                  KNN    0.7019
1        Decision Tree    0.7404
2                  SVM    0.7308
3  Logistic Regression    0.7404